{
  "products": [
    {
      "id": 1,
      "type": "star_wars",
      "title": "Caneca StormTrooper",
      "price": 60,
      "img": "../../../../assets/images/star_wars/star1.svg",
      "description": "Informações Técnicas: Altura: 11cm Comprimento: 12cm Largura: 13cm Peso: 58gr Capacidade: 500ml Material: Cerâmica"
    },
    {
      "id": 2,
      "type": "star_wars",
      "title": "Head Darth Vader Lego",
      "price": 120,
      "img": "../../../../assets/images/star_wars/star2.svg",
      "description": "Escape do estresse da vida cotidiana por um tempo e aproveite algum tempo de qualidade recriando todos os detalhes ameaçadores do capacete de Darth Vader com este kit de construção colecionável LEGO Star Wars (75304)O design icônico do capacete de Darth Vader é recriado em peças LEGO para despertar memórias de cenas clássicas da saga Star Wars, e o suporte de exibição com placa de identificação completa uma peça central impressionante. Este conjunto faz parte de uma série de modelos colecionáveis de capacetes LEGO Star Wars construídos para exibir - procure o novo capacete Scout Trooper (75305).Este conjunto de 834 peças oferece uma experiência de construção complexa e gratificante e é um excelente presente de aniversário, feriado ou surpresa para qualquer entusiasta de Star Wars, construtor de LEGO experiente ou hobby.Medindo mais de 20 cm de altura, 15 cm de largura e 14 cm de profundidade, este modelo de capacete Darth Vader montável não precisa de muito espaço para exibição, mas causa um grande impacto visual."
    },
    {
      "id": 3,
      "type": "star_wars",
      "title": "Yoda Action Figure",
      "price": 100,
      "img": "../../../../assets/images/star_wars/star3.svg",
      "description": "ACESSÓRIOS INSPIRADOS NO PERSONAGEM: Esta figura Star Wars The Vintage Collection vem com 2 acessórios inspirados em Star Wars. DESIGN INCRÍVEL COM ARTICULAÇÃO: Com múltiplos pontos de articulação e detalhes realísticos, esta figura Star Wars pode ser posicionada junto a outras figuras e veículos."
    },
    {
      "id": 4,
      "type": "star_wars",
      "title": "Traje StormTrooper",
      "price": 500,
      "img": "../../../../assets/images/star_wars/star4.svg",
      "description": "Fantasia Flametrooper de luxo oficialmente licenciada de Star Wars: O Despertar da Força, uma marca registrada da Disney e Lucasfilm; procure por embalagens e etiquetas com logotipo da marca registrada para ajudar a garantir que você tenha recebido um item autêntico testado de segurança."
    },
    {
      "id": 5,
      "type": "star_wars",
      "title": "Baby Yoda Toy",
      "price": 80,
      "img": "../../../../assets/images/star_wars/star5.svg",
      "description": "Inspirado pela série da Disney+, O Mandaloriano, o adorável boneco de pele verde, grandes orelhas e olhos se parece com um bebê Yoda, mas é chamado de A Criança. "
    },
    {
      "id": 6,
      "type": "star_wars",
      "title": "Action Figure Kylo Ren",
      "price": 300,
      "img": "../../../../assets/images/star_wars/star6.svg",
      "description": "Figura interativa do Kylo Ren apresenta mais de 60 efeitos sonoros e frases ativados por movimento. Colocar o capacete para sons, frases e efeitos Kylo Ren prontos para a batalha."
    },
    {
      "id": 7,
      "type": "consoles",
      "title": "Controle Xbox Series",
      "price": 300,
      "img": "../../../../assets/images/consoles/console1.svg",
      "description": "Conecte-se, jogue e alterne rapidamente entre dispositivos, incluindo Xbox Series X|S, Xbox One, PC com Windows 10, telefones e tablets compatíveis. Compatível com dispositivos selecionados e versões de sistema operacional. Algumas funcionalidades não são suportadas no Android via Bluetooth"
    },
    {
      "id": 8,
      "type": "consoles",
      "title": "Playstation 5",
      "price": 4999,
      "img": "../../../../assets/images/consoles/console2.svg",
      "description": "Domine o poder de uma CPU e GPU personalizadas e o SSD com E/S integradas que redefinem as regras do que o console PlayStation pode fazer. Maravilhe-se com os gráficos incríveis e experimente os recursos do novo PS5"
    },
    {
      "id": 9,
      "type": "consoles",
      "title": "SNES Classic",
      "price": 600,
      "img": "../../../../assets/images/consoles/console3.svg",
      "description": "Conecte a uma TV ou computador via HDMI e jogue centenas de jogos instantaneamente. Monitores de TV 4K serão mais claros. Permite que você desfrute facilmente de jogos animados e interessantes na tela grande. Permite que você possa desfrutar facilmente de videogames vívidos e emocionantes em uma tela grande."
    },
    {
      "id": 10,
      "type": "consoles",
      "title": "Joy-Cons Nintendo Switch",
      "price": 450,
      "img": "../../../../assets/images/consoles/console4.svg",
      "description": "Os controles Joy-Con incluídos permitem total flexibilidade no jogo. Passe um Joy-Con a um amigo para uma diversão instantânea com dois jogadores; ou convide mais amigos com seus próprios controles para uma festa de jogos. "
    },
    {
      "id": 11,
      "type": "consoles",
      "title": "Xbox Series X",
      "price": 2500,
      "img": "../../../../assets/images/consoles/console5.svg",
      "description": "Jogue milhares de títulos: todos os jogos têm melhor aparência e são melhor executados no Xbox Series X. Explore novos mundos e desfrute da ação como nunca antes com 12 teraflops incomparáveis de poder de processamento gráfico. "
    },
    {
      "id": 12,
      "type": "consoles",
      "title": "GameBoy Advance",
      "price": 300,
      "img": "../../../../assets/images/consoles/console6.svg",
      "description": "Mini Game Portátil 400 Jogos Super Console Jogos Retrô Tamanho da tela: 3.0 Polegadas inch Super Wide LCD. Cores Sortidas"
    },
    {
      "id": 13,
      "type": "anothers",
      "title": "Camiseta Atari",
      "price": 35,
      "img": "../../../../assets/images/diversos/diversos1.svg",
      "description": "100% Algodão. Alta durabilidade. Acabamento excelente"
    },
    {
      "id": 14,
      "type": "anothers",
      "title": "Camiseta Controle SNES",
      "price": 35,
      "img": "../../../../assets/images/diversos/diversos2.svg",
      "description": "100% Algodão. Alta durabilidade. Acabamento excelente"
    },
    {
      "id": 16,
      "type": "anothers",
      "title": "Toy Sonic",
      "price": 120,
      "img": "../../../../assets/images/diversos/diversos3.svg",
      "description": "Personagem: sonic with ring. Possui aproximadamente 9 cm. Figura colecionável produzida pela funko. Material: pvc "
    },
    {
      "id": 17,
      "type": "anothers",
      "title": "Radio Antigo",
      "price": 200,
      "img": "../../../../assets/images/diversos/diversos4.svg",
      "description": "O Rádio Recarregável Portátil Livstar AM/FM CNN 686 é leve, fácil de carregar, possui alça para transporte e funciona com energia elétrica, pilhas ou bateria."
    },
    {
      "id": 18,
      "type": "anothers",
      "title": "Oculus VR",
      "price": 2800,
      "img": "../../../../assets/images/diversos/diversos5.svg",
      "description": "Oculus Quest 2 é o nosso sistema de RV tudo-em-um mais avançado até agora. Cada detalhe foi projetado para fazer com que os mundos virtuais se adaptem aos seus movimentos, permitindo que você explore jogos e experiências impressionantes com liberdade incomparável. Nenhum PC ou console necessário."
    },
    {
      "id": 19,
      "type": "anothers",
      "title": "Fantasia Pikachu Adulto",
      "price": 400,
      "img": "../../../../assets/images/diversos/diversos6.svg",
      "description": "Produto oficialmente licenciado. O produto inclui: macacão com capuz. Pokemon"
    }
  ],
  "comments": [
    {
      "id": 1,
      "body": "some comment",
      "postId": 1
    }
  ],
  "profile": {
    "name": "typicode"
  }
}
